[Killed] BlockStatement
src/calculaTaxaDesconto.ts:2:79
 
-function calculaTaxaDesconto(tipoClient: string, valorCompra: number): number {
-    let taxa = 0;
-
-    if(valorCompra >= 500 || tipoClient === "ouro") {
-        return 15;
-    } else {
-        if(tipoClient === "prata" || valorCompra >= 400) {
-            taxa = 10;
-        } else {
-            if(valorCompra >= 200 || tipoClient === "bronze") {
-                taxa = 5;
-            }
-        }
-    }
-
-    return taxa;
-}
+function calculaTaxaDesconto(tipoClient: string, valorCompra: number): number {}
 
 export {
killedBy: calculaTaxaDesconto Should return 0 when tipoClient is empty and lower then 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/calculaTaxaDesconto.ts:5:53
 function calculaTaxaDesconto(tipoClient: string, valorCompra: number): number {
     let taxa = 0;
 
-    if(valorCompra >= 500 || tipoClient === "ouro") {
-        return 15;
-    } else {
+    if(valorCompra >= 500 || tipoClient === "ouro") {} else {
         if(tipoClient === "prata" || valorCompra >= 400) {
             taxa = 10;
killedBy: calculaTaxaDesconto Should return 15 when tipoClient is empty and greater then or equal 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] ConditionalExpression
src/calculaTaxaDesconto.ts:5:8
 function calculaTaxaDesconto(tipoClient: string, valorCompra: number): number {
     let taxa = 0;
 
-    if(valorCompra >= 500 || tipoClient === "ouro") {
+    if(false || tipoClient === "ouro") {
         return 15;
     } else {
killedBy: calculaTaxaDesconto Should return 15 when tipoClient is empty and greater then or equal 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 10

[Killed] BlockStatement
src/calculaTaxaDesconto.ts:7:12
 
     if(valorCompra >= 500 || tipoClient === "ouro") {
         return 15;
-    } else {
-        if(tipoClient === "prata" || valorCompra >= 400) {
-            taxa = 10;
-        } else {
-            if(valorCompra >= 200 || tipoClient === "bronze") {
-                taxa = 5;
-            }
-        }
-    }
+    } else {}
 
     return taxa;
killedBy: calculaTaxaDesconto Should return 5 when tipoClient is empty and greater then or equal 200 and lower then 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/calculaTaxaDesconto.ts:8:12
     if(valorCompra >= 500 || tipoClient === "ouro") {
         return 15;
     } else {
-        if(tipoClient === "prata" || valorCompra >= 400) {
+        if(false || valorCompra >= 400) {
             taxa = 10;
         } else {
killedBy: calculaTaxaDesconto Should return 10 when tipoClient is prata and valorCompra is lower than 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] ConditionalExpression
src/calculaTaxaDesconto.ts:8:12
     if(valorCompra >= 500 || tipoClient === "ouro") {
         return 15;
     } else {
-        if(tipoClient === "prata" || valorCompra >= 400) {
+        if(false) {
             taxa = 10;
         } else {
killedBy: calculaTaxaDesconto Should return 10 when tipoClient is empty and greater then or equal 400 and lower then 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] BlockStatement
src/calculaTaxaDesconto.ts:10:16
     } else {
         if(tipoClient === "prata" || valorCompra >= 400) {
             taxa = 10;
-        } else {
-            if(valorCompra >= 200 || tipoClient === "bronze") {
-                taxa = 5;
-            }
-        }
+        } else {}
     }
 
killedBy: calculaTaxaDesconto Should return 5 when tipoClient is empty and greater then or equal 200 and lower then 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/calculaTaxaDesconto.ts:11:16
         if(tipoClient === "prata" || valorCompra >= 400) {
             taxa = 10;
         } else {
-            if(valorCompra >= 200 || tipoClient === "bronze") {
+            if(valorCompra > 200 || tipoClient === "bronze") {
                 taxa = 5;
             }
killedBy: calculaTaxaDesconto Should return 5 when tipoClient is empty and greater then or equal 200 and lower then 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] LogicalOperator
src/calculaTaxaDesconto.ts:11:16
         if(tipoClient === "prata" || valorCompra >= 400) {
             taxa = 10;
         } else {
-            if(valorCompra >= 200 || tipoClient === "bronze") {
+            if(valorCompra >= 200 && tipoClient === "bronze") {
                 taxa = 5;
             }
killedBy: calculaTaxaDesconto Should return 5 when tipoClient is empty and greater then or equal 200 and lower then 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
