[Killed] BlockStatement
src/validaIdentificador.ts:1:37
-function isLetter(c:string):boolean {
-    const code = c.charCodeAt(0);
-    return (code >= 65 && code <= 90) || (code >= 97 && code <= 122);
-}
+function isLetter(c:string):boolean {}
 
 function isNumber(c:string):boolean {
killedBy: isLetter Should return true when character is letter a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/validaIdentificador.ts:3:57
 function isLetter(c:string):boolean {
     const code = c.charCodeAt(0);
-    return (code >= 65 && code <= 90) || (code >= 97 && code <= 122);
+    return (code >= 65 && code <= 90) || (code >= 97 && true);
 }
 
killedBy: isLetter Should return false when character is {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/validaIdentificador.ts:3:27
 function isLetter(c:string):boolean {
     const code = c.charCodeAt(0);
-    return (code >= 65 && code <= 90) || (code >= 97 && code <= 122);
+    return (code >= 65 && true) || (code >= 97 && code <= 122);
 }
 
killedBy: isLetter Should return false when character is \
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/validaIdentificador.ts:6:37
     return (code >= 65 && code <= 90) || (code >= 97 && code <= 122);
 }
 
-function isNumber(c:string):boolean {
-    const code = c.charCodeAt(0);
-    return (code >= 48 && code <= 57);
-}
+function isNumber(c:string):boolean {}
 
 function validaIdentificador(identificador:string | null):boolean {
killedBy: isNumber Should return true when character is number 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/validaIdentificador.ts:8:27
 
 function isNumber(c:string):boolean {
     const code = c.charCodeAt(0);
-    return (code >= 48 && code <= 57);
+    return (code >= 48 && true);
 }
 
killedBy: isNumber Should return false when character is :
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/validaIdentificador.ts:8:13
 
 function isNumber(c:string):boolean {
     const code = c.charCodeAt(0);
-    return (code >= 48 && code <= 57);
+    return (code >= 48 || code <= 57);
 }
 
killedBy: isNumber Should return false when character is /
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/validaIdentificador.ts:13:8
 
 function validaIdentificador(identificador:string | null):boolean {
 
-    if(!identificador) {
+    if(false) {
         return false;
     }
killedBy: validaIdentificador Should return false when identificador is null
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
src/validaIdentificador.ts:13:8
 
 function validaIdentificador(identificador:string | null):boolean {
 
-    if(!identificador) {
+    if(identificador) {
         return false;
     }
killedBy: validaIdentificador Should return false when identificador is null
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
src/validaIdentificador.ts:14:16
 function validaIdentificador(identificador:string | null):boolean {
 
     if(!identificador) {
-        return false;
+        return true;
     }
 
killedBy: validaIdentificador Should return false when identificador is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/validaIdentificador.ts:17:36
         return false;
     }
 
-    if(identificador.length < 1 || identificador.length > 6) {
+    if(identificador.length < 1 || identificador.length <= 6) {
         return false;
     }
killedBy: validaIdentificador Should return true when identificador is just one letter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/validaIdentificador.ts:17:8
         return false;
     }
 
-    if(identificador.length < 1 || identificador.length > 6) {
+    if(identificador.length >= 1 || identificador.length > 6) {
         return false;
     }
killedBy: validaIdentificador Should return true when identificador is just one letter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/validaIdentificador.ts:18:16
     }
 
     if(identificador.length < 1 || identificador.length > 6) {
-        return false;
+        return true;
     }
 
killedBy: validaIdentificador Should return false when identificador is more then 6 characters lenght
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] MethodExpression
src/validaIdentificador.ts:21:27
         return false;
     }
 
-    const firstCharCode = identificador.charAt(0);
+    const firstCharCode = identificador;
     if(!isLetter(firstCharCode)) {
         return false;

[Killed] BooleanLiteral
src/validaIdentificador.ts:22:8
     }
 
     const firstCharCode = identificador.charAt(0);
-    if(!isLetter(firstCharCode)) {
+    if(isLetter(firstCharCode)) {
         return false;
     }
killedBy: validaIdentificador Should return true when identificador is just one letter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/validaIdentificador.ts:22:8
     }
 
     const firstCharCode = identificador.charAt(0);
-    if(!isLetter(firstCharCode)) {
+    if(true) {
         return false;
     }
killedBy: validaIdentificador Should return true when identificador is just one letter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/validaIdentificador.ts:23:16
 
     const firstCharCode = identificador.charAt(0);
     if(!isLetter(firstCharCode)) {
-        return false;
+        return true;
     }
 
killedBy: validaIdentificador Should return false when identificador start with a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/validaIdentificador.ts:27:11
     }
 
     let i = 1;
-    while(i < identificador.length) {
+    while(false) {
         let char = identificador.charAt(i);
         if(!isLetter(char) && !isNumber(char)) {
killedBy: validaIdentificador Should return false when identificador has any character different of letters or numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/validaIdentificador.ts:27:11
     }
 
     let i = 1;
-    while(i < identificador.length) {
+    while(i >= identificador.length) {
         let char = identificador.charAt(i);
         if(!isLetter(char) && !isNumber(char)) {
killedBy: validaIdentificador Should return true when identificador is just one letter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/validaIdentificador.ts:28:20
 
     let i = 1;
     while(i < identificador.length) {
-        let char = identificador.charAt(i);
+        let char = identificador;
         if(!isLetter(char) && !isNumber(char)) {
             return false;
killedBy: validaIdentificador Should return false when identificador has any character different of letters or numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/validaIdentificador.ts:29:31
     let i = 1;
     while(i < identificador.length) {
         let char = identificador.charAt(i);
-        if(!isLetter(char) && !isNumber(char)) {
+        if(!isLetter(char) && isNumber(char)) {
             return false;
         }
killedBy: validaIdentificador Should return true when identificador is lower then or equal 6 characters lenght with letters and number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/validaIdentificador.ts:29:48
     let i = 1;
     while(i < identificador.length) {
         let char = identificador.charAt(i);
-        if(!isLetter(char) && !isNumber(char)) {
-            return false;
-        }
+        if(!isLetter(char) && !isNumber(char)) {}
         i++;
     }
killedBy: validaIdentificador Should return false when identificador has any character different of letters or numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/validaIdentificador.ts:30:20
     while(i < identificador.length) {
         let char = identificador.charAt(i);
         if(!isLetter(char) && !isNumber(char)) {
-            return false;
+            return true;
         }
         i++;
killedBy: validaIdentificador Should return false when identificador has any character different of letters or numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
